Repository: rsandila/errconv
Catalog: po/*.po
Languages: af_za

source: private final void ErrorResponse() {} }
af_za: private final void FoutReaksie() {} }

source: #define %s_NUM_ERROR %d
af_za: #define %1$s_NUM_ERROR %2$d

source: /* This file has been automatically generated -- DO NOT EDIT */
af_za: /* Die lêer is automaties gegenereer -- Moenie verander nie!!! */

source: const int %s_NUM_ERROR = %d;
af_za: const int %1$s_HOEFEELHEID_FOUTE = %2$d;

source: public static String getErrorString(int errcode) { try { return ((ErrorObj)(errHash.get(new Integer(errcode)))).description; } catch (Exception e) { return new String( "Unknown Error Occured" ); } } private %s() { } }
af_za: public static String kryFoutBeskrywing(int fout_kode) { try { return ((FoutOnderwerp)(foutHash.get(new Integer(fout_kode)))).beskrywing; } catch (Exception e) { return new String( "Onbekende Fout Het Gebeur" ); } } private %s() { } }

source: public static void initHashMap() { try { errHash=new HashMap( 150 );
af_za: public static void beginHashKaart() { try { foutHash=new HashMap( 150 );

source: %s
af_za: %1$s

source: --c - Generate C files. Requires that --cnout be specified.
af_za: --c - Genereer C lêers. --cnout moet ook gespesifiseer word.

source: --c++ - Generate C++ files. Requires that --cout be specified.
af_za: --c++ - Genereer C++ lêers. --cout moet ook gespesifiseer word.

source: --cnout - The base name used for generating the C file names.
af_za: --cnout - Die basis naam vir die gegenereerde C lêers.

source: --cout - The base name used for generating the C++ file names.
af_za: --cout - Die basis naam vir die gegenereerde C++ lêers.

source: --help - This screen.
af_za: --help - Die skerm.

source: --in - The error definition input file.
af_za: --in - Die fout boodskap definisie lêer.

source: --java - Generate Java files. Requires that --jout be specified.
af_za: --java - Genereer Java lêers. --jout moet gespesifiseer word.

source: --jout - The base name used for generating the Java file names.
af_za: --jout - Die basis naam vir die gegenereerde Java lêers.

source: errHash.put(new Integer(%s), new ErrorObj(%s.%s, %s.%s, new String(%s)));
af_za: foutHash.put(new Integer(%1$s), new FoutVoorwerp(%2$s.%3$s, %4$s.%5$s, new String(%6$s)));

source: int %sErrorCode_To_Level( int code, int *level );
af_za: int %sFoutKode_Na_Vlak( int fout_kode, int *vlak );

source: int %sErrorCode_To_Message( int code, char *message, int len );
af_za: int %sFoutKode_Na_Boodskap( int kode, char *boodskap, int lengte );

source: int %sErrorCode_To_Name( int code, char *name, int len );
af_za: int %sFoutKode_Na_Naam( int kode, char *naam, int lengte );

source: int %sErrorCode_To_Response( int code, int *response );
af_za: int %sFoutKode_Na_Reaksie( int kode, int *reaksie );

source: static unsigned int ErrorCode_To_Level( int code, int *level );
af_za: static unsigned int FoutKode_Na_Vlak( int kode, int *vlak );

source: static unsigned int ErrorCode_To_Message( int code, char *message, int len );
af_za: static unsigned int FoutKode_Na_Boodskap( int kode, char *boodskap, int lengte );

source: static unsigned int ErrorCode_To_Name( int code, char *name, int len );
af_za: static unsigned int FoutKode_Na_Naam( int kode, char *naam, int lengte );

source: static unsigned int ErrorCode_To_Response( int code, int *response );
af_za: static unsigned int FoutKode_Na_Reaksie( int kode, int *reaksie );

source: #define %s_LEVEL_%-20s 0x0%08X
af_za: #define %s_VLAK_%-20s 0x0%08X

source: #define %s_RESPONSE_%-20s 0x0%08X
af_za: #define %s_REAKSIE_%-20s 0x0%08X

source: %s %s compiled on %s, %s
af_za: %1$s %2$s saamgestel op %3$s, %4$s

source: ABORT
af_za: ABORTEER

source: ALERT
af_za: WAARSKU

source: C base name not specified.
af_za: C basis naam nie gespesifiseer nie.

source: C++ base name not specified.
af_za: C++ basis naam nie gespesifiseer nie.

source: CRIT
af_za: KRITIEK

source: Class did not initialize properly.
af_za: Klas het nie ordentelik begin nie.

source: EMERG
af_za: REGTIGKRITIEK

source: ERR
af_za: FOUT

source: Entries %d and %d have identical error codes.
af_za: Inskrywings %1$d en %2$d het identiese fout kodes.

source: Entries %d and %d have identical names: %s
af_za: Inskrywings %1$d en %2$d het identiese name: %3$s

source: Error
af_za: Fout

source: Error.java
af_za: Fout.java

source: FALLOVER
af_za: PROBEERANDER

source: File %s contains %d lines.
af_za: Lêer %1$s het %2$d lyne in.

source: File seems to have grown???
af_za: Lêer het groter geword???

source: For Errorcode 3 the following is true: Name=%s, Level=%d, Response=%d, Message=%s
af_za: Vir Foutkode 3, is die volgende waar: Naam=%1$s, Vlak=%2$d. Reaksie=%3$d, Boodskap=%4$s

source: IGNORE
af_za: IGNOREER

source: INFO
af_za: INLIGTING

source: ImpLevel
af_za: ImpVlak

source: ImpLevel.java
af_za: ImpVlak.java

source: Invalid command line option.
af_za: Ongeldige opsie gegee.

source: Invalid formatted string: %d
af_za: Ongeldige geformateerde inligting: %d

source: Invalid level %s specified in line %d
af_za: Ongeldige vlak %1$s gespesifiseer in lyn %2$d

source: Invalid response %s specified in line %d
af_za: Ongeldige reaksie %1$s gespesifiseer op lyn %2$d

source: Java base name not specified.
af_za: Java basis naam nie gespesifiseer nie.

source: NOTICE
af_za: KYKHIER

source: No input file defined.
af_za: Geen inset lêer gespesifiseer.

source: No output type defined.
af_za: Geen uitset lêer gespesifiseer.

source: No parameters defined.
af_za: Geen parameters gespesifiseer.

source: No read access to %s
af_za: Kan nie %s lees nie

source: Out of memory allocating objects.
af_za: Kan nie meer goed onthou nie.

source: Out of memory.
af_za: Kan nie onthou nie.

source: PANIC
af_za: PANIEK

source: RETRY
af_za: PROBEERWEER

source: Response
af_za: Reaksie

source: Response.java
af_za: Reaksie.java

source: The base name is too long.
af_za: Die basis naam is te lank.

source: Unable to create: %s
af_za: Kan nie %s skep nie.

source: Unable to determine length of file: %s
af_za: Kan nie lengte van %s bepaal nie

source: Unable to initialize CPP Parser.
af_za: Fout om die CPP komponent aan die gang te kry.

source: Unable to initialize Java Parser.
af_za: Fout om die Java komponent aan die gang te kry.

source: Unable to open %s
af_za: Kan nie %s oop maak nie

source: Unable to resolve level.
af_za: Weet nie wat vlak beteken nie.

source: Unable to resolve message.
af_za: Weet nie wat boodskap beteken nie.

source: Unable to resolve name.
af_za: Weet nie wat naam beteken nie.

source: Unable to resolve response.
af_za: Weet nie wat reaksie beteken nie.

source: Usage: %s --in infile [--c++] [--java] [--cout base-name] [--jout base-name] [--help]
af_za: Usage: %s --in inset [--c++] [--java] [--cout basis-naam] [--jout basis-naam] [--help]

source: WARNING
af_za: WAARSKUWING

source: Warning: Empty or invalid lines detected.
af_za: Pasop: Lee of ongeldige lyne opgespoor.

source: _Errors
af_za: _Foute

source: const int %s_LEVEL_%-20s = 0x0%08X;
af_za: const int %s_VLAK_%-20s = 0x0%08X;

source: const int %s_RESPONSE_%-20s = 0x0%08X;
af_za: const int %s_REAKSIE_%-20s = 0x0%08X;

source: int %sErrorCode_To_Level( int code, int *level )
af_za: int %sFoutKode_Na_Vlak( int kode, int *vlak )

source: int %sErrorCode_To_Message( int code, char *message, int len )
af_za: int %sFoutKode_Na_Boodksap( int kode, char *boodskap, int lengte )

source: int %sErrorCode_To_Name( int code, char *name, int len )
af_za: int %sFoutKode_Na_Naam( int kode, char *naam, int lengte )

source: int %sErrorCode_To_Response( int code, int *response )
af_za: int %sFoutKode_Na_Reaksie( int kode, int *reaksie )

source: package %s; /* This code has been automatically generated -- DO NOT EDIT */
af_za: package %s; /* Die kode is automaties gegenereer - MOET NIE VERANDER NIE */

source: package %s; import java.util.HashMap; import commoncode.*; /* This code has been automatically generated -- DO NOT EDIT */
af_za: package %s; import java.util.HashMap; import commoncode.*; /* Die kode is automaties gegenereer - MOET NIE VERANDER NIE */

source: public class %s { private static HashMap errHash=null;
af_za: public class %s { private static HashMap FoutHash=null;

source: struct error_defs { int code; char *name; int level; int response; char *message; };
af_za: struct fout_defs { int kode; char *naam; int vlak; int reaksie; char *boodskap; };

source: struct error_defs %sS[%d]= {
af_za: struct fout_defs %sS[%d]= {

source: unsigned int %s::ErrorCode_To_Level( int code, int *level )
af_za: unsigned int %s::FoutKode_Na_Vlak( int kode, int *vlak )

source: unsigned int %s::ErrorCode_To_Message( int code, char *message, int len )
af_za: unsigned int %s::FoutKode_Na_Boodskap( int kode, char *boodskap, int lengte )

source: unsigned int %s::ErrorCode_To_Name( int code, char *name, int len )
af_za: unsigned int %s::FoutKode_Na_Naam( int kode, char *naam, int lengte )

source: unsigned int %s::ErrorCode_To_Response( int code, int *response )
af_za: unsigned int %s::FoutKode_Na_Reaksie( int kode, int *reaksie )

source: { int cnt; for (cnt=0;cnt<%s_NUM_ERROR;cnt++) { if (code==%sS[cnt].code) { *level=%sS[cnt].level; return 0; } } return 1; }
af_za: { int tel; for (tel=0;tel<%s_HOEFEELHEID_FOUTE;tel++) { if (kode==%sS[tel].kode) { *vlak=%sS[tel].vlak; return 0; } } return 1; }

source: { int cnt; for (cnt=0;cnt<%s_NUM_ERROR;cnt++) { if (code==%sS[cnt].code) { *level=%sS[cnt].level; return( 0 ); } } return(1); }
af_za: { int tel; for (tel=0;tel<%s_HOEFEELHEID_FOUTE;tel++) { if (kode==%sS[tel].kode) { *vlak=%sS[tel].vlak; return( 0 ); } } return(1); }

source: { int cnt; for (cnt=0;cnt<%s_NUM_ERROR;cnt++) { if (code==%sS[cnt].code) { *response=%sS[cnt].response; return 0; } } return 1; }
af_za: { int tel; for (tel=0;tel<%s_HOEFEELHEID_FOUTE;tel++) { if (kode==%sS[tel].kode) { *reaksie=%sS[tel].reaksie; return 0; } } return 1; }

source: { int cnt; for (cnt=0;cnt<%s_NUM_ERROR;cnt++) { if (code==%sS[cnt].code) { *response=%sS[cnt].response; return( 0 ); } } return(1); }
af_za: { int tel; for (tel=0;tel<%s_HOEFEELHEID_FOUTE;tel++) { if (kode==%sS[tel].kode) { *reaksie=%sS[tel].reaksie; return( 0 ); } } return(1); }

source: { int cnt; for (cnt=0;cnt<%s_NUM_ERROR;cnt++) { if (code==%sS[cnt].code) { if (strlen(%sS[cnt].message)+1>(unsigned)len) return 1; strcpy( message, %sS[cnt].message ); return 0; } } return 1; }
af_za: { int tel; for (tel=0;tel<%s_HOEFEELHEID_FOUTE;tel++) { if (kode==%sS[tel].kode) { if (strlen(%sS[tel].boodskap)+1>(unsigned)lengte) return 1; strcpy( boodskap, %sS[tel].boodskap ); return 0; } } return 1; }

source: { int cnt; for (cnt=0;cnt<%s_NUM_ERROR;cnt++) { if (code==%sS[cnt].code) { if (strlen(%sS[cnt].message)+1>len) return( 1 ); strcpy( message, %sS[cnt].message ); return( 0 ); } } return(1); }
af_za: { int tel; for (tel=0;tel<%s_HOEFEELHEID_FOUTE;tel++) { if (kode==%sS[tel].kode) { if (strlen(%sS[tel].boodskap)+1>lengte) return( 1 ); strcpy( boodskap, %sS[tel].boodskap ); return( 0 ); } } return(1); }

source: { int cnt; for (cnt=0;cnt<%s_NUM_ERROR;cnt++) { if (code==%sS[cnt].code) { if (strlen(%sS[cnt].name)+1>(unsigned)len) return 1; strcpy( name, %sS[cnt].name ); return 0; } } return 1; }
af_za: { int tel; for (tel=0;tel<%s_HOEFEELHEID_FOUTE;tel++) { if (kode==%sS[tel].kode) { if (strlen(%sS[tel].naam)+1>(unsigned)lengte) return 1; strcpy( naam, %sS[tel].naam ); return 0; } } return 1; }

source: { int cnt; for (cnt=0;cnt<%s_NUM_ERROR;cnt++) { if (code==%sS[cnt].code) { if (strlen(%sS[cnt].name)+1>len) return( 1 ); strcpy( name, %sS[cnt].name ); return( 0 ); } } return(1); }
af_za: { int tel; for (tel=0;tel<%s_HOEFEELHEID_FOUTE;tel++) { if (kode==%sS[tel].kode) { if (strlen(%sS[tel].naam)+1>lengte) return( 1 ); strcpy( naam, %sS[tel].naam ); return( 0 ); } } return(1); }
